water-hammer/fluid3d-left/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 98100;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 98100;
    }

    outlet
    {
        type            zeroGradient;
    }


    fixedWalls
    {
        type    zeroGradient;       // no normal pressure gradient at walls
    }

}

// ************************************************************************* //
