water-hammer/fluid3d-left/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid3DLeft;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              Fluid3DLeft-Mesh;
    patches           (outlet);
    
    readData
    (
      Velocity
    );
    
    writeData
    (
      Pressure
    );
  };
};